// Задача 1 Напишите программу, которая на вход принимает одно число (N), а на выходе показывает все целые числа в промежутке от -N до N.

/*
Console.Write("Input a positive integer number: ");
int number = Convert.ToInt32(Console.ReadLine());
int current = - number;
while(current <= number)
{
    Console.Write(current + " ");
    current++; 
}
*/

// Задача 2 Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает последнюю цифру этого числа.
/*
Console.Write("Input three-digit number: ");
int number = Convert.ToInt32(Console.ReadLine());
int result = number % 10;
Console.WriteLine($"Last digit of {number} is {result}");
*/


